#### BumpmapType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "BumpmapType" from the "BumpMap" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum BumpmapType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BumpmapType ``` |

| Visual C++ |
| --- |
| ``` public enum class BumpmapType ``` |

# Members

| Member name | Description |
| --- | --- |
| HeightMap |  |
| NormalMap |  |

# See Also

Autodesk.Revit.DB.Visual Namespace